# Возьмем за основу данный образ
# Данная команда установит уже готвоый образ с python:3.7
# После чего поверх него установит дополнительные 
# команды которые мы укажем дальше
FROM python:3.7

# Airflow глобальные переменные
ARG AIRFLOW_VERSION=2.1.4 # В прошлых работах мы использовали 2.0 версию, но на этом уроке поработаем с предыдущей версией

# Устанавливаем домашнюю директорию внутри контейнера
# При первом запуске Airflow в каталоге $AIRFLOW_HOME
# будет создан файл airflow.cfg.
ENV AIRFLOW_HOME=/usr/local/airflow

# Установка airflow с поддержкой postgres
RUN pip install apache-airflow[postgres]==${AIRFLOW_VERSION}

# Установка библиотеки для работы базами данных, специальная версия с которой будет работать данная сборка
RUN pip install SQLAlchemy==1.3.23

# Создаем директрию для нашего проекта внутри образа
RUN mkdir /project

# Копируем скрипты из нашего проекта в докер контейнер
COPY scripts/ /project/scripts/

# Копируем кастомизированный конфиг нашего проекта в докер контейнер
COPY config/airflow.cfg ${AIRFLOW_HOME}/airflow.cfg

# Доступы для скрипта, дополнительная настройка
# Просто дает скрипту дополнительные права
RUN chmod +x /project/scripts/init.sh

# Запускаем sh скрипт
# Данный код запустит код который начнет процесс установки сервиса и инициализации
ENTRYPOINT ["/project/scripts/init.sh"]